Revit 2026 API

# UIApplicationMacroUpdated Event

---

MacroUpdated.

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public event EventHandler<MacroUpdatedEventArgs> MacroUpdated
```
```vb
Public Event MacroUpdated As EventHandler(Of MacroUpdatedEventArgs)
```
```cpp
public:
 event EventHandler<MacroUpdatedEventArgs^>^ MacroUpdated {
	void add (EventHandler<MacroUpdatedEventArgs^>^ value);
	void remove (EventHandler<MacroUpdatedEventArgs^>^ value);
}
```
```fsharp
member MacroUpdated : IEvent<EventHandler<MacroUpdatedEventArgs>,
    MacroUpdatedEventArgs>
```

#### Value

EventHandlerMacroUpdatedEventArgs

This event is raised after macro modules were updated.

#### Reference

UIApplication Class

Autodesk.Revit.UI Namespace